## Importar pandas

In [2]:
import pandas as pd

## Ler DataFrame de arquivo CSV

In [115]:
data = pd.read_csv('titanic/train.csv') # Comma Separated Values - Valores Separados Por Vírgula

## Primeiras Linhas

In [57]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## Últimas Linhas

In [58]:
data.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Informações do DataFrame

In [59]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Resumo Estatístico de Campos Numéricos

In [60]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Resumo estatístico de campos Categóricos

In [61]:
data.describe(include='O')

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

## Renomear colunas

In [62]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
data.rename({'Name': 'Nome', 'Sex': 'Sexo'}, axis=1, inplace=True)

In [64]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Nome', 'Sexo', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [116]:
data.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 
                'IrmaosConjuge','PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

In [66]:
data.head(2)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [67]:
data.columns

Index(['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade',
       'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine',
       'Embarque'],
      dtype='object')

# Selecionar Colunas Específicas

In [68]:
data[['Nome','Sexo','Classe','Tarifa','Idade','Sobreviveu']].head()

,Nome,Sexo,Classe,Tarifa,Idade,Sobreviveu
0,"Braund, Mr. Owen Harris",male,3,7.2500,22.0,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,71.2833,38.0,1
2,"Heikkinen, Miss. Laina",female,3,7.9250,26.0,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,53.1000,35.0,1
4,"Allen, Mr. William Henry",male,3,8.0500,35.0,0

## Selecionando apenas uma coluna - Data Series

In [69]:
data['Sexo'] #dataserie é apenas a coluna do nosso dataframe, e ele so pode executar apena um elemento por vez.
data[['Sexo','Nome']] #dataframe pode ser varios elementos

       Sexo                                               Nome
0      male                            Braund, Mr. Owen Harris
1    female  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    female                             Heikkinen, Miss. Laina
3    female       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4      male                           Allen, Mr. William Henry
..      ...                                                ...
886    male                              Montvila, Rev. Juozas
887  female                       Graham, Miss. Margaret Edith
888  female           Johnston, Miss. Catherine Helen "Carrie"
889    male                              Behr, Mr. Karl Howell
890    male                                Dooley, Mr. Patrick

[891 rows x 2 columns]

## Funções matemáticas embutidas

In [70]:
data['Idade'].std() #std = desvio padrão

14.526497332334044

In [71]:
data['Idade'].mean() #media soma de todos os valores divida pela quantidade de valores

29.69911764705882

In [72]:
data['Idade'].sum() #soma

21205.17

In [73]:
data['Idade'].count() #contagem

714

In [74]:
data['Idade'].median() #mediana valor que divide no meio

28.0

In [75]:
data['Idade'].mode() #moda valor que mais se repete

0    24.0
dtype: float64

In [76]:
data['Idade'].max() #maior valor

80.0

In [77]:
data['Idade'].min() * 12  #menor valor

5.04

In [78]:
data['Idade'].idxmin() #indice do menor valor

803

In [79]:
data['Idade'].idxmax() #indice do maior valor

630

In [80]:
data.mean() #media de todas as colunas

C:\Users\Lucas\AppData\Local\Temp/ipykernel_9640/651695864.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean() #media de todas as colunas

IdPassageiro     446.000000
Sobreviveu         0.383838
Classe             2.308642
Idade             29.699118
IrmaosConjuge      0.523008
PaisFilhos         0.381594
Tarifa            32.204208
dtype: float64

In [81]:
data.sum() #soma de todas as colunas

C:\Users\Lucas\AppData\Local\Temp/ipykernel_9640/2222140364.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.sum() #soma de todas as colunas

IdPassageiro                                                397386
Sobreviveu                                                     342
Classe                                                        2057
Nome             Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sexo             malefemalefemalefemalemalemalemalemalefemalefe...
Idade                                                     21205.17
IrmaosConjuge                                                  466
PaisFilhos                                                     340
Bilhete          A/5 21171PC 17599STON/O2. 31012821138033734503...
Tarifa                                                  28693.9493
dtype: object

In [82]:
data.median() #mediana de todas as colunas

C:\Users\Lucas\AppData\Local\Temp/ipykernel_9640/2873654424.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.median() #mediana de todas as colunas

IdPassageiro     446.0000
Sobreviveu         0.0000
Classe             3.0000
Idade             28.0000
IrmaosConjuge      0.0000
PaisFilhos         0.0000
Tarifa            14.4542
dtype: float64

In [83]:
data.min() #menor valor de todas as colunas

C:\Users\Lucas\AppData\Local\Temp/ipykernel_9640/2014066141.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.min() #menor valor de todas as colunas

IdPassageiro                       1
Sobreviveu                         0
Classe                             1
Nome             Abbing, Mr. Anthony
Sexo                          female
Idade                           0.42
IrmaosConjuge                      0
PaisFilhos                         0
Bilhete                       110152
Tarifa                           0.0
dtype: object

## Selecionando pelo Index - iloc localiza pelo index

In [84]:
data.iloc[630] #linha 630 resumo de uma só linha

IdPassageiro                                      631
Sobreviveu                                          1
Classe                                              1
Nome             Barkworth, Mr. Algernon Henry Wilson
Sexo                                             male
Idade                                            80.0
IrmaosConjuge                                       0
PaisFilhos                                          0
Bilhete                                         27042
Tarifa                                           30.0
Cabine                                            A23
Embarque                                            S
Name: 630, dtype: object

In [85]:
data.iloc[[803]] #linha 803 resumo de uma só linha

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C

In [86]:
data.iloc[[630,803,80]] #podemos exibir 3 linhas ao mesmo tempo desta forma

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,0,0,27042,30.0000,A23,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
80,81,0,3,"Waelens, Mr. Achille",male,22.00,0,0,345767,9.0000,NaN,S

In [87]:
data.iloc[:3] #tres primeiros elementos
#data.iloc[1:10] #do 1 ao 10
#data.iloc[100:] #do 100 e diante
#data.iloc[-10:] #todo s os valores -1

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [88]:
data['Classe'].iloc[2] #valor da coluna Classe na linha 2

3

## Operador de seleção "loc" - seleciona de acordo com uma condição na maioria das vezes

In [89]:
data[['Idade','Sexo','Tarifa','Classe','Sobreviveu']].loc[data['Sexo'] == 'male'].head()

   Idade  Sexo   Tarifa  Classe  Sobreviveu
0   22.0  male   7.2500       3           0
4   35.0  male   8.0500       3           0
5    NaN  male   8.4583       3           0
6   54.0  male  51.8625       1           0
7    2.0  male  21.0750       3           0

In [90]:
## operador de negação no python é o ~ mesma coisa que o not

In [114]:
data[['Idade','Sexo','Tarifa','Classe','Sobreviveu']]\
.loc[(data['Idade']>=3) & (data['Idade']<=10) & ~data['Sobreviveu'] == 1] #condição para mostrar crianças entre 3 e 10 anos e quais sobreviveram

     Idade Sexo   Tarifa  Classe  Sobreviveu
24     8.0  NaN  21.0750       3           0
50     7.0  NaN  39.6875       3           0
63     4.0  NaN  27.9000       3           0
147    9.0  NaN  34.3750       3           0
171    4.0  NaN  29.1250       3           0
182    9.0  NaN  31.3875       3           0
278    7.0  NaN  29.1250       3           0
374    3.0  NaN  21.0750       3           0
419   10.0  NaN  24.1500       3           0
480    9.0  NaN  46.9000       3           0
541    9.0  NaN  31.2750       3           0
634    9.0  NaN  27.9000       3           0
787    8.0  NaN  29.1250       3           0
813    6.0  NaN  31.2750       3           0
819   10.0  NaN  27.9000       3           0
850    4.0  NaN  31.2750       3           0
852    9.0  NaN  15.2458       3           0

## Selecionando com múltiplas condições

In [113]:
data[['Idade','Sexo','Classe','Sobreviveu']].\
    loc[(data['Idade']>= 14)\
         & (data['Sobreviveu'] == 1) \
             & (data['Sexo'] == 'male')\
                 &(data['Classe']==3)].count()

Idade         0
Sexo          0
Classe        0
Sobreviveu    0
dtype: int64

## map e replace duas opções para subistituir valores

In [112]:
data['Sexo'].map({'male':'homem', 'female': 'mulher'}).head() #subistitui os valores male por homem e female por mulher ainda n foi aplicado

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Sexo, dtype: object

In [111]:
data['Sexo'].replace({'male':'homem', 'female': 'mulher'}) #subistitui os valores male por homem e female por mulher ainda n foi aplicado

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
886   NaN
887   NaN
888   NaN
889   NaN
890   NaN
Name: Sexo, Length: 891, dtype: float64

In [110]:
data['Sexo'].replace(['male','female'], ['homem','mulher']) #outra maneira de utilizar o replace. no primeiro colchetes os valores que eu quero e no segundo o que eu quero subitstituir na ordem

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
886   NaN
887   NaN
888   NaN
889   NaN
890   NaN
Name: Sexo, Length: 891, dtype: float64

In [96]:
data['Sexo'].replace(['male','female'], 'pessoa').head() #nesse caso ira subistuit todos os valores por pessoa essa e a vantagem do replace

0    pessoa
1    pessoa
2    pessoa
3    pessoa
4    pessoa
Name: Sexo, dtype: object

In [109]:
data['Sexo'].replace('male', 'homem').head()#pode se utilizado sem o colchetes

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Sexo, dtype: object

In [119]:
data['Sexo'].replace(['male','female'], ['homem','mulher'], inplace=True) #inplace ja altera td no dataframe

In [99]:
data['Sexo'] = data['Sexo'].map({'male':'homem', 'female': 'mulher'}) #alternativa ao inplace

In [100]:
data['Sexo']

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
      ...
886    NaN
887    NaN
888    NaN
889    NaN
890    NaN
Name: Sexo, Length: 891, dtype: object

## Groupby - Agrupar por -

In [101]:
data.groupby('Sexo').mean() #PODE SE AGRUPAR POR SOMA, COUNT E ETC.

Empty DataFrame
Columns: [IdPassageiro, Sobreviveu, Classe, Idade, IrmaosConjuge, PaisFilhos, Tarifa]
Index: []

In [102]:
data.groupby(['Sexo','Sobreviveu']).mean()

Empty DataFrame
Columns: [IdPassageiro, Classe, Idade, IrmaosConjuge, PaisFilhos, Tarifa]
Index: []

In [103]:
data.groupby(['Sexo','Classe']).mean()

Empty DataFrame
Columns: [IdPassageiro, Sobreviveu, Idade, IrmaosConjuge, PaisFilhos, Tarifa]
Index: []

## Crosstab

In [124]:
pd.crosstab(data['Sobreviveu'], data['Classe'], margins=True).style.background_gradient(cmap='OrRd') #margins pega o somatorio

In [122]:
pd.crosstab(data['Sobreviveu'], data['Sexo'], margins=True).style.background_gradient(cmap='Blues') #normalize pode ser index ou columns

## Ordenando Dados

In [129]:
data[['Idade','Sexo','Classe','Sobreviveu']].sort_values('Idade', ascending=True).head()

     Idade    Sexo  Classe  Sobreviveu
803   0.42   homem       3           1
755   0.67   homem       2           1
644   0.75  mulher       3           1
469   0.75  mulher       3           1
78    0.83   homem       2           1
..     ...     ...     ...         ...
859    NaN   homem       3           0
863    NaN  mulher       3           0
868    NaN   homem       3           0
878    NaN   homem       3           0
888    NaN  mulher       3           0

[891 rows x 4 columns]

In [131]:
data[['Idade','Sexo','Classe','Sobreviveu']].sort_index(ascending=False).head()

     Idade    Sexo  Classe  Sobreviveu
890   32.0   homem       3           0
889   26.0   homem       1           1
888    NaN  mulher       3           0
887   19.0  mulher       1           1
886   27.0   homem       2           0

## Lidando com dados faltando $\rightarrow$ NaN - Not a Number

In [133]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Cabine           687
Embarque           2
dtype: int64

In [135]:
data['Embarque'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Embarque, Length: 891, dtype: bool

In [136]:
data.loc[data['Embarque'].isnull()]

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
61,62,1,1,"Icard, Miss. Amelie",mulher,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",mulher,62.0,0,0,113572,80.0,B28,NaN

In [139]:
data['Embarque'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [141]:
data['Embarque'].mode() #moda

0    S
dtype: object

In [143]:
data.describe(include='O')

                           Nome   Sexo Bilhete   Cabine Embarque
count                       891    891     891      204      889
unique                      891      2     681      147        3
top     Braund, Mr. Owen Harris  homem  347082  B96 B98        S
freq                          1    577       7        4      644

In [150]:
data['Embarque'].fillna('Q', inplace=True)

In [148]:
data['Embarque'].at[61] = 'S'

In [149]:
data['Embarque'].at[61]

'S'

In [152]:
data['Embarque'].at[829] = 'S'

In [153]:
data['Embarque'].at[829]

'S'

## Deletando Coluna ou Linha

In [158]:
data.isnull().sum()

IdPassageiro       0
Sobreviveu         0
Classe             0
Nome               0
Sexo               0
Idade            177
IrmaosConjuge      0
PaisFilhos         0
Bilhete            0
Tarifa             0
Embarque           0
dtype: int64

In [157]:
data.drop('Cabine', axis=1, inplace=True) #0 = linha, 1 = coluna

In [165]:
data.drop([4,3,2]) #colocar inplace para confirmar a exclusão

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",homem,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",mulher,38.0,1,0,PC 17599,71.2833,C
5,6,0,3,"Moran, Mr. James",homem,NaN,0,0,330877,8.4583,Q
6,7,0,1,"McCarthy, Mr. Timothy J",homem,54.0,0,0,17463,51.8625,S
7,8,0,3,"Palsson, Master. Gosta Leonard",homem,2.0,3,1,349909,21.0750,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",homem,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",mulher,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",mulher,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",homem,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",homem,32.0,0,0,370376,7.7500,Q

In [162]:
data.head(3)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",homem,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",mulher,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",mulher,26.0,0,0,STON/O2. 3101282,7.9250,S

In [170]:
data.drop(['Sobreviveu','Nome','Tarifa'], axis=1).head() #colocar inplace para confirmar a exclusão

,IdPassageiro,Classe,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Embarque
0,1,3,homem,22.0,1,0,A/5 21171,S
1,2,1,mulher,38.0,1,0,PC 17599,C
2,3,3,mulher,26.0,0,0,STON/O2. 3101282,S
3,4,1,mulher,35.0,1,0,113803,S
4,5,3,homem,35.0,0,0,373450,S

## Apply e Lambda

In [174]:
data['Idade'].apply(lambda x: x**2) #função lambda

0       484.0
1      1444.0
2       676.0
3      1225.0
4      1225.0
        ...
886     729.0
887     361.0
888       NaN
889     676.0
890    1024.0
Name: Idade, Length: 891, dtype: float64

In [193]:
data['Bilhete'] = data['Bilhete'].apply(lambda x: x[:-1]) #x e cada elemento da linha, da coluna do bilhete

0             A/5 211
1              PC 175
2      STON/O2. 31012
3                1138
4                3734
            ...
886              2115
887              1120
888          W./C. 66
889              1113
890              3703
Name: Bilhete, Length: 891, dtype: object

In [194]:
data['Bilhete']

0             A/5 2117
1              PC 1759
2      STON/O2. 310128
3                11380
4                37345
            ...
886              21153
887              11205
888          W./C. 660
889              11136
890              37037
Name: Bilhete, Length: 891, dtype: object

## Variáveis Dummy | HotEncoder 
#### o computador não consegue entender strings, e a forma de ele entender é de 0 e 1 isso se da atravpes das variaveis dummy

In [198]:
data = pd.get_dummies(data,columns=['Sexo'],drop_first=True)  #cria colunas com valores 0 ou 1

In [199]:
data

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_mulher
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,0
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,21153,13.0000,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,11205,30.0000,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 660,23.4500,S,1
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,11136,30.0000,C,0
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,37037,7.7500,Q,0

In [202]:
embarque = pd.get_dummies(data['Embarque'], drop_first=True)

In [204]:
data.head()

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Embarque,Sexo_mulher
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,S,0

## Concatenando DataFrames

In [205]:
data = pd.concat([data, embarque], axis=1)

In [206]:
data.shape

(891, 13)

In [209]:
data.drop('Embarque', axis=1, inplace=True)

# Expressões Regulares

.  - qualquer caracter
<br>\d - dígitos (0-9)
<br>\D - exceto dígitos (0-9)
<br>\w - palavra (a-z, A-Z, 0-9, \_)
<br>\s - espaço em branco (tab, espaço, nova linha)
<br>\S - qualquer coisa exceto espaço em branco (tab, espaço, nova linha)
<br>\b - início de uma palavra
<br>\B - exceto início da palavra
<br>^ - inicio de uma String
<br>$ - final de uma string
<br>[] - caracteres em colchetes
<br>[^] - caracteres não em colchetes
<br>| - ou
<br>( ) - grupo

<h3>Quantificadores</h3>
<br>* - nenhum ou mais
<br>+ - um ou mais
<br>? - nenhum ou um
<br>{3} - número exato
<br>{3,4} - range de Números (mínimo, máximo)

Referência (inglês): 
http://bit.ly/ExpressoesRegulares

In [219]:
data['Titulo'] = data['Nome'].str.extract('([a-zA-Z]+)\.')

In [220]:
data

,IdPassageiro,Sobreviveu,Classe,Nome,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Sexo_mulher,Q,S,Titulo
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 2117,7.2500,0,0,1,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 1759,71.2833,1,0,0,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 310128,7.9250,1,0,1,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,11380,53.1000,1,0,1,Mrs
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,37345,8.0500,0,0,1,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,0,21153,13.0000,0,0,1,Rev
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,11205,30.0000,1,0,1,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 660,23.4500,1,0,1,Miss
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,11136,30.0000,0,0,0,Mr
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,0,37037,7.7500,0,1,0,Mr

# Engenharia de Recursos - Feature Engineering

In [223]:
data['Sexo'] = data['Sexo_mulher'].map({0:'homem', 1:'mulher'})

In [228]:
pd.crosstab(data['Titulo'], data['Sexo'])

Sexo    homem  mulher
Titulo
Master     40       0
Miss        0     182
Mr        517       0
Mrs         0     125
Outros     20       7

In [227]:
data['Titulo'] = data['Titulo'].apply(lambda x: 'Outros' if x not in ['Mr','Mrs','Miss','Master'] else x)

In [232]:
data[['Titulo','Sexo','Idade','Classe','Sobreviveu']].loc[data['Titulo']== 'Master'].mean()

C:\Users\Lucas\AppData\Local\Temp/ipykernel_9640/1852742835.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data[['Titulo','Sexo','Idade','Classe','Sobreviveu']].loc[data['Titulo']== 'Master'].mean()

Idade         4.574167
Classe        2.625000
Sobreviveu    0.575000
dtype: float64

## Mudando Valores Linha Por Linha - iterrows()

In [3]:
cabine = pd.read_csv('titanic/train.csv')

In [5]:
cabine['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [9]:
for idx, _ in cabine[['Cabin']].dropna().iterrows():
    cabine_individual = cabine['Cabin'].at[idx]
    cabine['Cabin'].at[idx] = cabine_individual[0]

In [17]:
cabine[['Cabin','Survived','Sex', 'Pclass']].dropna().groupby(['Cabin','Sex']).count()

              Survived  Pclass
Cabin Sex
A     female         1       1
      male          14      14
B     female        27      27
      male          20      20
C     female        27      27
      male          32      32
D     female        18      18
      male          15      15
E     female        15      15
      male          17      17
F     female         5       5
      male           8       8
G     female         4       4
T     male           1       1

In [16]:
cabine.loc[cabine['Cabin']=='T']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
339,340,0,1,"Blackwell, Mr. Stephen Weart",male,45.0,0,0,113784,35.5,T,S